Autodesk.Revit.DB.GeometryElement.AddForTransientDisplay(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.Collections.Generic.IList`1{Autodesk.Revit.DB.GeometryObject},Autodesk.Revit.DB.ElementId)
Adds collection of GeometryObjects to the transient (temporary) element for application display which will not be saved with the model.
Returns: Resulting GeometryElement after adding collection
Since:  2015

Autodesk.Revit.DB.GeometryElement.SetForTransientDisplay(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,System.Collections.Generic.IList`1{Autodesk.Revit.DB.GeometryObject},Autodesk.Revit.DB.ElementId)
Creates or set geometry of transient (temporary) element for application display which will not be saved with the model.
Returns: The element id of the created element.
Since:  2015